#### BuiltInFailures.ColumnInsideWallFailures Members

---

|  |
| --- |
| BuiltInFailures ColumnInsideWallFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ColumnInsideWallFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ColumnInsideWall | One element is completely inside another. |
| Public property Static member | CopingWarningExtension | Coping applied, but no cut was made. Adjust Coping Distance or Extension parameters. |
| Public property Static member | CopingWarningIgnored | Cuts on concrete members are ignored. |
| Public property Static member | CopingWarningMedium | Coping applied, but only in Medium Detail Level. |
| Public property Static member | CopingWarningOffset | Coping applied, but no cut was made. Adjust Coping Distance or Offset parameters. |
| Public property Static member | StartCutShadowJoin | Two joined walls are in a position to allow automatic insert copying. |
| Public property Static member | StopCutShadowJoin | Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping. |

# See Also

BuiltInFailures ColumnInsideWallFailures Class

Autodesk.Revit.DB Namespace